<template>
  <article class="article">
    <h1 class="h1 tac">AllByMusic用户服务协议</h1>
    <p class="p tac">版本生效日期：2024年8⽉26⽇</p>
    <h2 class="h2">一、本协议的确认和接受</h2>
    <p class="p">
      <strong class="strong">1、当您按照注册⻚⾯提示完成信息填写并同意本协议内容后，本协议在您与我司之间成⽴并发⽣法律效⼒。</strong>
    </p>
    <p class="p">
      <strong class="strong"> 2、
        为了您能够使用AllByMusic所提供的各项服务，您需要同意本协议下您所选服务对应的服务条款。如果您在18周岁以下，您需要在监护⼈的监护参与下才能注册并使⽤AllByMusic提供的各项服务，您的下单⾏为视为您满⾜前述条件，您及法定监护⼈应按照法律及本协议规定承担责任。
        在您对本协议内容存在异议、⽆法准确理解或持有反对意⻅的情况下，您有权利⽴即停⽌⽤户注册进程，拒绝接受AllByMusic提供的任何服务。</strong>
    </p>
    <p class="p">
      <strong>3、 本协议内容包括协议正⽂及AllByMusic所有已经发布的或将来可能发布并采取合理途径通知的各类条款、限制与要
        求。前述各项为本协议的补充条款，与本协议正⽂具有同等法律效⼒。AllByMusic有权根据相关法律法规的出台或修订、主管部⻔的要求以及服务⽅式的变更等情况酌情变更本协议内容，您理解并同意关于本协议的任何变更，AllByMusic将以刊载公告或者弹窗的形式进⾏通知。为⽅便您浏览查看，AllByMusic可能会在AllByMusic小程序内多处展示或请您多次确认同⼀更新版
        本，但更新版本仍在您⾸次确认同意之⽇起⽣效。若您不同意相关条款的变更，您有权⽴即终⽌使⽤AllByMusic的服务。您的继续使⽤⾏为，视为知悉变动内容并同意接受。</strong>
    </p>

    <h2 class="h2">二、服务简介</h2>
    <p class="p">
      <strong>1、 您可以在AllByMusic上查询演出/赛事（以下合称“项⽬”）的名称、时间、地点、演员/球员阵容等相关信息，继⽽选择您意向的项⽬场次并进⾏购票。</strong>
    </p>
    <p class="p">
      <strong> 2、
        在各项⽬开始售票前，AllByMusic会履⾏审慎义务，查阅各项⽬的⾏政审批⼿续及主办⽅/承办⽅的相关证照及资质⽂件。请您注意，对于不属于AllByMusic主办的项⽬，AllByMusic并⽆能⼒完全辨别出资料⽂件的真伪，AllByMusic仅作为您选择项⽬的类型、购买票品以及获取项⽬相关宣传信息的渠道，⽆法保证或控制项⽬的如期举⾏或质量。</strong>
    </p>
    <p class="p">
      <strong class="strong">3、
        根据相关法律法规规定或⾏政部⻔对特殊项⽬要求，AllByMusic的部分服务或特殊项⽬将要求您进⾏实名认证，否则AllByMusic将因法律规定或相关要求⽆法为您提供相应的服务。</strong>
    </p>
    <p class="p">
      4、 除购票外，您还可以通过AllByMusic购买其他商品或服务，包括购买衍⽣品、有价优惠券、会员卡等。具体商品、服务的内容、提供⽅信息及相关规则等以⻚⾯约定为准。 </p>
    <p class="p">
      5、 您可以在AllByMusic发布并分享对演出/赛事等项⽬的评论，在AllByMusic发布话题、上传图⽚、视频等。您理解并同意，
      您应为⾃⼰注册账号下的⾏为负责，包括您所发表任何内容、评论及分享等⾏为，以及由此产⽣的任何后果。您应当保证所发布内容的真实、准确、合法，并承担因发布或使⽤内容⽽引起的⻛险。AllByMusic将按照相关法律法规规定针对您发布的内容进⾏形式审核，但⽆法且不会对因前述⻛险⽽导致的损失或损害承担责任，且有权⾃⾏或者应权利⼈要求删除或屏蔽相关内容。如因您的侵权⾏为导致AllByMusic遭受损失的（包括不限于经济、商誉等损失），您还应⾜额赔偿AllByMusic遭受的全部损失。
    </p>

    <h2 class="h2">三、服务变更、中断及终⽌</h2>
    <p class="p">
      1、
      AllByMusic保留变更、中断及终⽌全部或部分服务的权利和根据实际情况随时调整提供的服务种类、服务内容、服务⽅式的权利。对于调整，AllByMusic将尽可能提前进⾏公告。若AllByMusic终⽌服务，将提前⾄少三⼗⽇公示有关信息。
    </p>
    <p class="p">
      <strong class="strong">
        2、 在接收公安、检察院、法院等⾏政或司法机关通知的情况下，AllByMusic可⽴即将您在AllByMusic注册的账户及账户内余额（如有）暂时中断或冻结，直⾄接到前述机关作出的解除的书⾯通知后恢复。</strong>
    </p>


    <h2 class="h2">四、关于您的账户</h2>
    <p class="p">
      <strong>1、 您成为AllByMusic注册⽤户后，您有权随时更改您的账户密码，同时您有义务谨慎保存、使⽤账户密码。</strong>
    </p>
    <p class="p">
      <strong class="strong"> 2、
        您需⾃⾏负责对您的账户名、昵称和密码保密，且须对该账户名、昵称和密码下发⽣的所有活动（包括但不限于信息披露、发布信息、⽹上点击同意或购买服务等）承担责任。</strong>您同意：
    </p>
    <p class="p">
      （1） 您成为AllByMusic注册⽤户后，因服务所需，AllByMusic可能会收集您的姓名、性别、⽣⽇、电⼦邮箱、银⾏卡号、收货地址等个⼈信息；</p>
    <p class="p">
      （2） 确保您在每个上⽹时段结束时，以正确步骤离开⽹站。AllByMusic⽆法对因您未能遵守本款规定⽽发⽣的任何损
      失或损毁负责。您理解AllByMusic对您的请求采取⾏动需要合理时间，AllByMusic对在采取⾏动前已经产⽣的后果（包括但不限于您的任何损失）不承担任何责任；
    </p>
    <p class="p">
      （3） 如发现任何⼈未经授权使⽤您的账户名、昵称和密码等其他情况，您可以⽴即通知AllByMusic，并授权AllByMusic采取
      相应的限制⾏动；您同意在任何情况下不向他⼈泄露账号及密码信息，请您知悉，AllByMusic不会主动向您索要账号密码。关于账号的安全，AllByMusic将会在⽬前技术⽔平下努⼒保护您的账号在服务器端的安全，并不断更新技术措施。当您怀疑账号出现被盗等不安全情况时，请⽴即通知AllByMusic。因您主动泄露或因您遭受他⼈攻击、诈骗等⾏为导致的损失及后
      果，您可以通过司法、⾏政等救济途径向侵权⾏为⼈追偿。如您需要协助的，AllByMusic将在届时的法律框架下尽⼒配合提供协助；
    </p>
    <p class="p">
      （4） 除⾮有法律规定或司法裁定，且征得AllByMusic的同意，否则，您的AllByMusic账户不得以任何⽅式转让、赠与或继承
      （与账户相关的财产权益除外）。
    </p>
    <p class="p">
      3、 您需确保您不是任何国家、地区或国际组织实施的贸易限制、经济制裁或其他法律法规限制的对象，也未直
      接或间接为前述对象提供资⾦、商品或服务，否则您应当停⽌使⽤AllByMusic服务，同时您理解违反前述要求可能会造成您
      ⽆法正常注册及使⽤AllByMusic服务。
    </p>
    <p class="p">
      4、 AllByMusic可基于服务需要，变更或增加履约主体，如继续使⽤AllByMusic服务，视为您同意变更后的主体或新增的主体作为与您履约的相对⽅。
    </p>

    <h2 class="h2">五、个⼈信息保护及管理</h2>
    <p class="p">
      1、 AllByMusic⾮常重视您的个⼈信息的保护，在您使⽤AllByMusic提供的服务时，<strong class="strong">您同意AllByMusic按照所公布的《隐私协议》
        收集、使⽤、分享、存储和保护您的个⼈信息。</strong>AllByMusic希望通过《隐私协议》向您清楚地介绍AllByMusic对您个⼈信息的处理⽅式，因此AllByMusic建议您完整地阅读《隐私协议》，以帮助您更好地保护您的个⼈信息。
    </p>
    <p class="p">
      2、 您声明并保证，您对您⽤于注册的⽤户名、昵称、简介中所含的全部信息拥有合法的权利。否则，AllByMusic可对您的⽤户名、昵称、简介进⾏删除或屏蔽。您应当确保您设定的⽤户名、昵称、简介中不包含以下内容：</p>
    <p class="p">
      （1） 党和国家领导⼈或其他社会名⼈的真实姓名、字号、艺名、笔名；</p>
    <p class="p">
      （2） 冒⽤国家机构或其他机构的名称；不⽂明、不健康字段，或包含歧视、侮辱、猥亵类词语的；
    </p>
    <p class="p">
      （3） 易产⽣歧义、引起他⼈误解或不符合法律规定的；
    </p>
    <p class="p">
      （4） 盗⽤他⼈头像或资料，冒充、利⽤他⼈名义的；
    </p>
    <p class="p">
      （5） 侵害他⼈肖像权、版权、商标权、商业秘密、或其他专属权利的；
    </p>
    <p class="p">（6） 强制性、诱导性、欺骗性信息、违规交易信息；
    </p>
    <p class="p">
      （7） 中国法律、法规、（部⻔）规章以及任何具有法律效⼒之规范所限制或禁⽌使⽤的其他信息；
    </p>
    <p class="p">
      （8） 有可能损害平台和其他⽤户利益的其他信息。
    </p>
    <p class="p">3、 <strong
        class="strong">为了更好地为您提供服务，AllByMusic可能会向关联公司共享您的个⼈信息；我们只会共享必要的个⼈信息，且受《隐私权政策》约束；关联公司指苏州天澄数字传媒有限公司。</strong>
    </p>


    <h2 class="h2">六、知识产权</h2>
    <p class="p">
      1、 AllByMusic在服务中提供的内容（包括但不限于⽹⻚、界⾯设计、版⾯框架、⽂字、⾳频、视频、图⽚或其他资料
      等）等知识产权归AllByMusic或相关权利⼈所有。除另有约定外，AllByMusic提供本服务时所依托的软件、系统等的著作权、专利权及其他知识产权归AllByMusic所有。未经AllByMusic事先书⾯同意，您不得擅⾃删除、掩盖或更改AllByMusic的版权声明、商标或其它权利声明，不得将AllByMusic的商标以任何⽅式展示或使⽤或作其它处理。

    </p>
    <p class="p">2、 <strong class="strong">您在AllByMusic上传或发布的内容应保证您为您发布内容（包括但不限于⽂字、图⽚、视频等）的著作权⼈或已取
        得合法授权，并且该内容不会侵犯任何第三⽅的合法权益，您同意授权AllByMusic及其关联公司可在全球范围内、完全免费、不可撤销的、⽆期限限制的、可转授权地使⽤上述所有内容。</strong>具体来说，可能会包括：
    </p>
    <p class="p">（1） 将前述内容复制、翻译、编⼊AllByMusic当前已知或以后开发的作品、媒体或技术中，⽤于AllByMusic相关⽤途开发或推⼴宣传等；</p>
    <p class="p">（2） 将前述内容授权给电台、电视台、⽹络媒体、运营商平台等与AllByMusic有合作的媒体或运营商播放、传播，⽤于AllByMusic相关推⼴宣传等；
    </p>
    <p class="p">（3） 其他AllByMusic及其关联公司出于善意或另⾏取得您授权的使⽤⾏为；
      <strong class="strong"> 您对AllByMusic及其关联公司的前述授权并不改变您发布内容的所有权及知识产权归属，也并不影响您⾏使对您⾃身发布内容的合法权利。</strong>

    </p>
    <p class="p"> <strong class="strong">3、 您知悉、理解并同意授权AllByMusic及其关联公司对您发布的内容进⾏审查、删减、修改等。</strong>
    </p>

    <p class="p"><strong class="strong">4、 AllByMusic对您在AllByMusic上传或发布的内容享有优先合作权。</strong>
    </p>


    <h2 class="h2">七、禁⽌的内容及⾏为</h2>
    <p class="p">
      1、禁⽌发布的内容
      您理解并承诺，您对⾃⾏发表、上传或传送的内容负全部责任，所有⽤户不得在AllByMusic任何⻚⾯发布、转载、传送
      含有下列内容之⼀的信息，否则，AllByMusic可对您发布的信息依法或依本条款约定进⾏删除或屏蔽，该类禁⽌发布的内容包括但不限于：
    </p>
    <p class="p">（1） 反对宪法所确定的基本原则的；</p>
    <p class="p">（2） 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统⼀的；</p>
    <p class="p">（3） 损害国家荣誉和利益的；
    </p>
    <p class="p">
      （4） 煽动⺠族仇恨、⺠族歧视、破坏⺠族团结的；
    </p>
    <p class="p">
      （5） 破坏国家宗教政策，宣扬邪教和封建迷信的；
    </p>
    <p class="p">
      （6） 散布谣⾔，扰乱社会秩序，破坏社会稳定的；
    </p>
    <p class="p">（7） 散布淫秽、⾊情、赌博、暴⼒、凶杀、恐怖或者教唆犯罪的；
    </p>
    <p class="p">
      （8） 虚假、诈骗、有害、胁迫、侵害他⼈隐私、骚扰、侵害、中伤、粗俗、猥亵、或其他道德上令⼈反感的内容；
    </p>
    <p class="p">
      （9） 侮辱或者诽谤他⼈，侵害他⼈合法权利的；
    </p>
    <p class="p">（10） 侵害他⼈肖像权、版权、商标权、商业秘密、或其他专属权利的内容； </p>
    <p class="p">（11） 中国法律、法规、（部⻔）规章以及任何具有法律效⼒之规范所限制或禁⽌的其他内容； </p>
    <p class="p">（12） 其他AllByMusic认为不适合在AllByMusic展示的内容。 </p>
    <p class="p">2、禁⽌的⾏为
      <strong class="strong">您理解并承诺，不就我⽅平台服务进⾏下列的禁⽌的⾏为，也不允许任何⼈利⽤您的账户进⾏下列⾏为，否则，
        AllByMusic可对通过冻结账户全部或部分功能，删除或屏蔽相关信息等⽅式制⽌该类⾏为并消除相关不利影响。该类禁⽌的
        ⾏为包括但不限于：</strong>
    </p>
    <p class="p"> （1） 以任何⽅式损害他⼈合法权益的； </p>
    <p class="p">（2） 冒充其他任何⼈或机构，或以虚伪不实的⽅式陈述或谎称与任何⼈或机构有关的； </p>
    <p class="p">（3） 未经合法授权⽽截获、篡改、收集、储存或删除他⼈的个⼈信息、交易订单、评论、消息或其他数据资料，或将获知的此类资料⽤于任何⾮法或不正当⽬的； </p>
    <p class="p">（4） 发布或传播前述第1款禁⽌发布内容的；
    </p>
    <p class="p">（5） 发布或传播 “促销资料”、“优惠信息”、“紧缺票品存货”、“⼴告信函”或其他任何形式的劝诱性的资料；
    </p>
    <p class="p">（6） 未经AllByMusic明确许可，使⽤AllByMusic平台服务⽤于任何商业⽤途或为任何第三⽅的利益；
    </p>
    <p class="p">（7） 将设计⽬的在于⼲扰、破坏或限制任何正常购票秩序、平台⽣态的软件、硬件或通讯设备功能之计算机病毒加以发布、发送或以其他⽅式传送；
    </p>
    <p class="p">（8） ⼲扰或破坏AllByMusic服务或与服务相连线之服务器和⽹络，或违反任何关于AllByMusic信息安全规定、程序、政策或规范；
    </p>
    <p class="p">
      （9） 作弊、恶意套现、虚假交易、批量注册、刷单、刷积分/优惠券、扰乱/破坏系统、使⽤机器模拟客户端、
      ⽹络攻击等不当⾏为； </p>
    <p class="p">（10） 对AllByMusic进⾏反向⼯程、反向汇编、编译或者以其他⽅式尝试发现AllByMusic的源代码；
    </p>
    <p class="p">（11） 使⽤任何插件、外挂、系统或第三⽅⼯具对AllByMusic的正常运⾏进⾏⼲扰、破坏、修改或施加其他影响，包括但不限于使⽤任何⾃动化程序、软件或类似⼯具接⼊AllByMusic
    </p>
    <p class="p">（12） 未经许可，企图探查、扫描、测试AllByMusic系统或⽹络的弱点或其他实施破坏⽹络安全的⾏为；
    </p>
    <p class="p">（13） ⾮法侵⼊⽹络、⼲扰⽹络正常功能、窃取⽹络数据等危害⽹络安全的活动；
    </p>
    <p class="p">（14） 中国法律、法规、（部⻔）规章以及任何具有法律效⼒之规范所限制或禁⽌的其他⾏为；
    </p>
    <p class="p">（15） 其他可能损害他⼈或AllByMusic平台利益的⾏为。
    </p>


    <h2 class="h2">⼋、责任范围与免责</h2>
    <p class="p">
      1、
      您明确理解并同意，作为演出/赛事项⽬的票务代理⽅，AllByMusic不承担除法律明确规定外的责任。若您与主办⽅之间出现争议，AllByMusic将尽⼒为您协调处理保障您的利益，但⽆法保证协调结果符合您的期望，AllByMusic⽆权对争议作出处理。
    </p>
    <p class="p"> <strong class="strong">2、 除因AllByMusic单⽅原因故意或过失导致您损失的情况外，AllByMusic不对您的损失承担责任。</strong></p>



    <h2 class="h2">九、赔偿</h2>
    <p class="p">
      <strong class="strong">AllByMusic尊重他⼈合法权益（包括知识产权、名誉权、商誉权等），呼吁您也尊重他⼈合法权益，您明确理解并同
        意，如因您违反有关法律法规或者本协议约定，使AllByMusic遭受任何损失或受到第三⽅的追索，或任何⾏政管理部⻔的处罚，AllByMusic有权采取相应⾏为来终⽌侵权⾏为，包括但不限于终⽌您对账户的使⽤、删除违规内容等，并有权要求您应赔偿AllByMusic因此受到的损失。
      </strong>
    </p>



    <h2 class="h2">⼗、不可抗⼒</h2>
    <p class="p">
      如因不可抗⼒或其它AllByMusic⽆法控制的原因使AllByMusic销售系统崩溃或⽆法正常使⽤导致⽹上交易⽆法完成、丢失有关
      的信息记录或服务被迫终⽌等情况，<strong class="strong"> 除法律有明确规定外，AllByMusic⽆须承担责任，另外，AllByMusic会尽可能合理地协助处理善后事宜，并努⼒使您免受经济损失。
      </strong>
    </p>


    <h2 class="h2">⼗⼀、法律适⽤及管辖</h2>
    <p class="p">
      <strong class="strong">1、 本协议的条款是可分割的，如本协议任何条款被裁定为⽆效或不可执⾏，该条款可被删除⽽其余条款应予以执⾏。 </strong>
    </p>
    <p class="p">2、 <strong
        class="strong">法律管辖和适⽤本协议的订⽴、执⾏和解释及争议的解决均应适⽤中国法律。如双⽅就本协议内容或其执⾏发⽣任何争议，双⽅应尽⼒友好协商解决；协商不成时，任何⼀⽅均可向北京互联⽹法院提起诉讼。</strong>
    </p>

  </article>
</template>

<style lang="scss" scoped>
.article {
  padding: 1em;
}

.h1,
.h2,
.h3,
.h4,
.h5,
.h6 {
  font-weight: bold;
  margin: 0.5em 0;
}

.h1 {
  font-size: 1.3em;
}

.h2 {
  font-size: 1.2em;
}

.h3 {
  font-size: 1.1em;
}

.p {
  text-indent: 2em;
  line-height: 1.5;
}

.strong {
  font-weight: bold;
  display: inline;
  text-decoration: underline;
}

.tac {
  text-align: center;
  text-indent: 0;
}
</style>
